backend/app/controllers/api/v1/foods_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "foods" ("user_id", "name", "calorie", "created_at", "updated_at", "carb", "fat", "protein", "sodium", "suger", "food_type", "quantity", "quantity_type") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
    def create
        require 'date'
        user = User.find(params[:user_id])
        data = food_cal(params[:query])
        quantity = params[:quantity].to_f()
        quantity_type = params[:quantityType]

        date = params[:date].to_datetime()

        puts "---------------------"
        puts date
        puts params[:date]
        value = (quantity_type == 'ml' || quantity_type == 'gram')? (quantity/100): quantity

        calorie = sprintf("%.2f", data[0]["calories"] * value)
        carb = sprintf("%.2f", data[0]["carbohydrates_total_g"] * value)
        fat = sprintf("%.2f", data[0]["fat_total_g"] * value)
        protein = sprintf("%.2f", data[0]["protein_g"] * value)
        sodium = sprintf("%.2f", data[0]["sodium_mg"] * value)
        sugar = sprintf("%.2f", data[0]["sugar_g"] * value)
        food_type = params[:food_type]
        user.foods.create(name:data[0]["name"],calorie: calorie,carb:carb, fat:fat, protein:protein, sodium:sodium, suger:sugar, food_type:food_type, created_at:date, updated_at:date, quantity:quantity,quantity_type:quantity_type)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT SUM("foods"."calorie") FROM "foods" WHERE "foods"."user_id" = ? AND (created_at >= '2023-04-13 00:00:00' AND created_at < '2023-04-14 00:00:00')  [["user_id", "1"]]
SELECT "foods".* FROM "foods" WHERE "foods"."user_id" = ? AND "foods"."food_type" = ?  [["user_id", "1"], ["food_type", "breakfast"]]
---
    def index
        require 'date'

        current_time = DateTime.now
        current_time = current_time.day.to_s + "/" + current_time.month.to_s + "/" + current_time.year.to_s

        user = User.find(params[:user_id])

        date = params[:selectedDate]

        current_date =  DateTime.parse(date)
        puts current_date

        total_intake = 0
        total_intake = (user.foods.where(['created_at >= ? AND created_at < ?', current_date, current_date + 1]).sum("calorie")).round(2)
        puts total_intake
        breakfast = user.foods.where(food_type:"breakfast")
        lunch = user.foods.where(food_type:"lunch")
        dinner = user.foods.where(food_type:"dinner")