backend/app/controllers/api/v1/medicines_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "medicines".* FROM "medicines" WHERE "medicines"."user_id" = ? AND (selectedDays like '%Thu%') AND (selectedTimings like '%morning%')  [["user_id", 1]]
---
    def index
        decoded_token = JWT.decode(params[:token], nil, false)
        user_id = decoded_token[0]["user_id"]
        day = Date.today.strftime("%a")
        puts day
        user = User.find(user_id)
        meds = user.medicines.where("selectedDays like ?","%#{day}%")
        morning_med = meds.where("selectedTimings like ?","%morning%")
        afternoon_med = meds.where("selectedTimings like ?","%afternoon%")
        evening_med = meds.where("selectedTimings like ?","%evening%")
        night_med = meds.where("selectedTimings like ?","%night%")

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "medicines" ("name", "med_type", "user_id", "created_at", "updated_at", "selectedDays", "selectedTimings") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def check
        # require jwt
        decoded_token = JWT.decode(params[:token], nil, false)
        user_id = decoded_token[0]["user_id"]
        puts user_id, decoded_token
        user = User.find(user_id)
        user.medicines.create(name: params[:medicineName], med_type:params[:medicineType], selectedDays:params[:selectedDays], selectedTimings: params[:selectedTimings])