backend/app/controllers/api/v1/registrations_controller.rb

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)