backend/app/controllers/api/v1/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "age" = ?, "gender" = ?, "height" = ?, "weight" = ?, "activity_level" = ?, "goal_weight" = ?, "calorie_intake" = ? WHERE "users"."id" = ?
---
    def count_cal
        # cal_track();
        user = User.find(params[:user_id])
        age = params[:age]
        gender = params[:gender]
        height = params[:height].to_f()
        weight = params[:weight].to_f()
        activity_level = params[:activity_level]
        goal_weight = params[:goal_weight].to_f()
        diff_weight = goal_weight.to_f()-weight.to_f()
        puts activity_level

        cal_data = cal_track(age=age, gender= gender, height= height, weight= weight, activity_level= activity_level)

        cal_intake =  cal_data["data"]["goals"]["maintain weight"]+ (1000*diff_weight)
        if user.update!(age:age,gender:gender,height:height, weight:weight, goal_weight:goal_weight, activity_level:activity_level,calorie_intake: cal_intake)

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        decoded_token = JWT.decode(params[:token], nil, false)
        user_id = decoded_token[0]["user_id"]
        user = User.find(user_id)